<?php
/**
 * Created by PhpStorm.
 * User: Jackson
 * Date: 2018/5/12
 * Time: 下午2:43
 */

/** @var array $class 班級 */
$class = [
    '學生1' => [
        '成績' => '100',
        '學號' => '00000001',
    ],
    'student2' => [
        '成績' => '99',
        '學號' => '00000002',
    ],
    'student3' => [
        '成績' => '98',
        '學號' => '00000003',
    ],
    'student4' => [
        '成績' => '87',
        '學號' => '00000004',
    ],
];
/** @var array $inventory 庫存 */
$inventory = [
    '品項1' => ['數量' => 1,],
    '品項2' => ['數量' => 2,],
];
/** @var array $lunchMenu 午餐 */
$lunchMenu = [
    '星期一' => [
        '前菜' => '前菜1',
        '小菜' => '小菜1',
        '飲料' => '飲料1',
        '花費' => 100,
    ],
    '星期二' => [
        '前菜' => '前菜2',
        '小菜' => '小菜2',
        '飲料' => '飲料2',
        '花費' => 200,
    ],
    '星期三' => [
        '前菜' => '前菜3',
        '小菜' => '小菜3',
        '飲料' => '飲料3',
        '花費' => 300,
    ],
    '星期四' => [
        '前菜' => '前菜4',
        '小菜' => '小菜4',
        '飲料' => '飲料4',
        '花費' => 400,
    ],
    '星期五' => [
        '前菜' => '前菜5',
        '小菜' => '小菜5',
        '飲料' => '飲料5',
        '花費' => 500,
    ],
    '星期六' => [
        '前菜' => '前菜6',
        '小菜' => '小菜6',
        '飲料' => '飲料6',
        '花費' => 600,
    ],
    '星期日' => [
        '前菜' => '前菜7',
        '小菜' => '小菜7',
        '飲料' => '飲料7',
        '花費' => 700,
    ],
];
/** @var array $family 家人名字 */
$family = ['王1', '李1', '王2', '王3', '王4',];
/** @var array $familyList 家人清單 */
$familyList = [
    '王1' => ['年紀' => 69, '稱謂' => '爸'],
    '李1' => ['年紀' => 68, '稱謂' => '媽'],
    '王2' => ['年紀' => 38, '稱謂' => '兄'],
    '王3' => ['年紀' => 30, '稱謂' => '姊'],
    '王4' => ['年紀' => 25, '稱謂' => '妹'],
];